Repository: tiredIsa/XrayUI-dev
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# MainWindow_Title
source: Proxy Panel
ru_ru: Панель прокси

# MainWindow_ToggleMini
source: Toggle mini window
ru_ru: Компактное окно

# MainWindow_ExpandFull
source: Back to full window
ru_ru: Развернуть окно

# MainWindow_Close
source: Close
ru_ru: Закрыть

# Tray_Open
source: Show App
ru_ru: Открыть приложение

# Tray_Exit
source: Quit
ru_ru: Выход

# Tray_TooltipIdle
source: XrayUI - Idle
ru_ru: XrayUI — отключён

# ServerList_Edit
source: Edit
ru_ru: Изменить

# ServerList_Delete
source: Delete
ru_ru: Удалить

# ServerList_Share
source: Share
ru_ru: Поделиться

# ServerList_SortActiveHint
source: Only available when filter is "All Servers"
ru_ru: Доступно только с фильтром «Все серверы»

# ServerList_AllServers
source: All Servers
ru_ru: Все серверы

# ServerList_Ungrouped
source: Ungrouped
ru_ru: Без группы

# ServerList_UnnamedSub
source: (Unnamed Subscription)
ru_ru: (Подписка без названия)

# ServerList_OrphanSub
source: (Deleted Subscription)
ru_ru: (Удалённая подписка)

# ControlPanel_Start
source: Start
ru_ru: Запустить

# ControlPanel_Stop
source: Stop
ru_ru: Остановить

# ControlPanel_StatusNotRunning
source: Idle
ru_ru: Отключён

# ControlPanel_StatusApplying
source: Applying...
ru_ru: Применение…

# ControlPanel_Personalize
source: Personalize
ru_ru: Оформление

# ControlPanel_RoutingGlobal
source: Global
ru_ru: Глобальная

# ControlPanel_RoutingSmart
source: Smart
ru_ru: По правилам

# ControlPanel_UpdateFound
source: New version {0}
ru_ru: Новая версия {0}

# ServerDetail_Address
source: Address
ru_ru: Адрес

# ServerDetail_Port
source: Port
ru_ru: Порт

# ServerDetail_Encryption
source: Encryption
ru_ru: Шифрование

# ServerDetail_Security
source: Security
ru_ru: Защита

# ServerDetail_OpenInBrowser
source: Open {0} in browser
ru_ru: Открыть {0} в браузере

# ServerDetail_RetestLatency
source: Retest latency
ru_ru: Повторить замер задержки

# ServerDetail_CopyShareLink
source: Copy share link
ru_ru: Скопировать ссылку на сервер

# ServerDetail_NoServer
source: No server selected
ru_ru: Сервер не выбран

# ServerDetail_NotTested
source: Not tested
ru_ru: Не проверено

# ServerDetail_Testing
source: Testing...
ru_ru: Проверка…

# ServerDetail_Timeout
source: Timeout
ru_ru: Время ожидания истекло

# ServerDetail_Failed
source: Failed
ru_ru: Ошибка

# Personalize_Header.Text
source: Personalization
ru_ru: Оформление

# Personalize_Theme.Text
source: Theme
ru_ru: Тема

# Personalize_Light.Content
source: Light
ru_ru: Светлая

# Personalize_Dark.Content
source: Dark
ru_ru: Тёмная

# Personalize_FollowSystem.Content
source: System
ru_ru: Системная

# Personalize_Backdrop.Text
source: Background Effect
ru_ru: Эффект фона

# Personalize_Acrylic.Content
source: Acrylic
ru_ru: Акрил

# Personalize_ProtocolColors.Text
source: Protocol Colors
ru_ru: Цвета протоколов

# Personalize_Reset.Text
source: Reset
ru_ru: Сбросить

# Personalize_OtherProtocol.Text
source: Other Protocols
ru_ru: Другие протоколы

# Personalize_OtherProtocolDesc.Text
source: Unmatched protocols will use this color
ru_ru: Цвет для остальных протоколов

# Personalize_DataManagement.Text
source: Import & Export
ru_ru: Импорт и экспорт

# Personalize_Done.Content
source: Done
ru_ru: Готово

# Personalize_ExportSuccess
source: Export Successful
ru_ru: Экспорт завершён

# Language_FollowSystem
source: Follow System
ru_ru: Как в системе

# Subscription_AddTooltip
source: Add Subscription
ru_ru: Добавить подписку

# Subscription_ManageTooltip
source: Manage Subscriptions
ru_ru: Управление подписками

# Subscription_Refresh
source: Refresh Subscription
ru_ru: Обновить подписку

# Subscription_DeleteTooltip
source: Delete Subscription
ru_ru: Удалить подписку

# Subscription_EditTooltip
source: Edit Subscription
ru_ru: Изменить подписку

source: Subscription fetch failed
ru_ru: Не удалось загрузить подписку

# Subscription_NoParsed
source: No valid nodes could be parsed from the subscription.
ru_ru: В подписке не найдено подходящих серверов.

# Subscription_UpdateFailed
source: Update failed: {0}
ru_ru: Не удалось обновить: {0}

# Subscription_StopFirst_Delete
source: Please stop the proxy before deleting
ru_ru: Перед удалением остановите прокси

# CustomRules_Title
source: Custom Routing Rules
ru_ru: Правила маршрутизации

# AddRule_Title
source: Add Rule
ru_ru: Добавить правило

# AddRule_ErrorEmpty
source: Please enter match content
ru_ru: Укажите условие совпадения

# Log_Title
source: Proxy Log
ru_ru: Журнал прокси

# Log_NotRunning
source: Not running
ru_ru: Остановлен

# Log_Running
source: Running
ru_ru: Работает

# Log_Lines
source: ({0} lines)
ru_ru: (строк: {0})

# Log_PrivacyTooltip
source: Log privacy settings
ru_ru: Настройки журнала

# Log_IpMask
source: IP Address Mask
ru_ru: Маскирование IP-адресов

# Log_MaskOff
source: Off
ru_ru: Выключено

# Log_AutoScroll
source: Auto Scroll
ru_ru: Автопрокрутка

# Log_CopyAll
source: Copy All
ru_ru: Скопировать всё

# Log_Clear
source: Clear
ru_ru: Очистить

# Log_PrivacyTitle
source: Log Privacy Settings
ru_ru: Конфиденциальность журнала

# Log_PrivacySaved
source: Saved. Takes effect on next TUN session start.
ru_ru: Сохранено. Настройки вступят в силу при следующем запуске TUN.

# Log_PrivacyFailed
source: Save failed: {0}
ru_ru: Не удалось сохранить: {0}

# Dialog_OK
source: OK
ru_ru: ОК

# Dialog_Cancel
source: Cancel
ru_ru: Отмена

# Dialog_Save
source: Save
ru_ru: Сохранить

# Dialog_Done
source: Done
ru_ru: Готово

# Dialog_Confirm
source: Confirm
ru_ru: Подтвердить

# Dialog_Add
source: Add
ru_ru: Добавить

# Dialog_Delete
source: Delete
ru_ru: Удалить

# Dialog_Replace
source: Replace
ru_ru: Заменить

# Dialog_Preparing
source: Preparing…
ru_ru: Подготовка…

# Dialog_On
source: On
ru_ru: Вкл.

# Dialog_Off
source: Off
ru_ru: Выкл.

# Import_Placeholder
source: Paste node links (multi-protocol supported)
ru_ru: Вставьте ссылки на серверы (поддерживаются разные протоколы)

# Import_Title
source: Import Node Links
ru_ru: Импорт ссылок на серверы

# Import_SupportHint
source: Supports common protocol links
ru_ru: Поддерживаются ссылки распространённых протоколов

# Import_ParseFailed
source: Parse Failed
ru_ru: Не удалось распознать ссылки

# Import_ParseFailedMsg
source: No valid node links found. Please verify your input and try again.
ru_ru: Подходящие ссылки на серверы не найдены. Проверьте введённые данные и повторите попытку.

# EditServer_AddTitle
source: Add Server Manually
ru_ru: Добавить сервер вручную

# EditServer_EditTitle
source: Edit Server
ru_ru: Изменить сервер

# EditServer_Name
source: Name
ru_ru: Название

# EditServer_Address
source: Address / Domain
ru_ru: Адрес / домен

# EditServer_Port
source: Port
ru_ru: Порт

# EditServer_Protocol
source: Protocol
ru_ru: Протокол

# EditServer_Encryption
source: Encryption (SS)
ru_ru: Шифрование (SS)

# EditServer_Password
source: Password
ru_ru: Пароль

# EditServer_Transport
source: Transport Protocol
ru_ru: Транспортный протокол

# EditServer_Path
source: Path (WS/gRPC/XHTTP)
ru_ru: Путь (WS/gRPC/XHTTP)

# EditServer_WsHost
source: Host Header (WS/XHTTP)
ru_ru: Заголовок Host (WS/XHTTP)

# EditServer_Security
source: Security
ru_ru: Защита

# EditServer_Fingerprint
source: Fingerprint (uTLS)
ru_ru: Отпечаток (uTLS)

# EditServer_AllowInsecure
source: Allow insecure connection (skip certificate verification)
ru_ru: Разрешить небезопасное соединение (не проверять сертификат)

# EditServer_FlowPlaceholder
source: xtls-rprx-vision or leave empty
ru_ru: xtls-rprx-vision или оставьте пустым

# EditPort_Title
source: Edit Local Port
ru_ru: Изменить локальный порт

# EditPort_Header
source: Local Port
ru_ru: Локальный порт

# EditPort_Range
source: Range: {0} - {1}
ru_ru: Диапазон: {0}–{1}

# Share_Title
source: Share Node
ru_ru: Поделиться сервером

# Share_CopyLink
source: Copy Link
ru_ru: Скопировать ссылку

# Share_NotSupported
source: Sharing Not Supported
ru_ru: Ссылка недоступна

# Share_NotSupportedMsg
source: This node protocol does not support generating share links.
ru_ru: Для протокола этого сервера нельзя создать ссылку для обмена.

# Startup_Title
source: Startup
ru_ru: Автозапуск

# Startup_AutoStart
source: Launch at startup
ru_ru: Запускать при входе в систему

# Startup_AutoConnect
source: Auto-connect to last node
ru_ru: Автоматически подключаться к последнему серверу

# Startup_SetFailed
source: Startup settings failed
ru_ru: Не удалось настроить автозапуск

# Confirm_DeleteTitle
source: Confirm Delete
ru_ru: Подтверждение удаления

# Confirm_DeleteMsg
source: Are you sure you want to delete {0}?
ru_ru: Удалить {0}?

# Confirm_ReplaceTitle
source: Replace current configuration?
ru_ru: Заменить текущую конфигурацию?

# Confirm_ReplaceMsg
source: This will overwrite all current servers and routing rules. We strongly recommend exporting a backup first. Continue?
ru_ru: Все текущие серверы и правила маршрутизации будут заменены. Рекомендуем сначала экспортировать резервную копию. Продолжить?

# EditServer_SocksUsername
source: Username
ru_ru: Имя пользователя

# EditServer_EchPlaceholder
source: e.g. udp://1.1.1.1 or server-generated ECHConfig
ru_ru: Например, udp://1.1.1.1 или ECHConfig сервера

# EditServer_FinalmaskPlaceholder
source: Empty = none; or mlkem768x25519plus.native.0rtt...
ru_ru: Пусто — без маскирования; или mlkem768x25519plus.native.0rtt…

# ChainProxy_AddTitle
source: Add Chain Proxy
ru_ru: Добавить цепочку прокси

# ChainProxy_EditTitle
source: Edit Chain Proxy
ru_ru: Изменить цепочку прокси

# Dns_DialogTitle
source: DNS Settings
ru_ru: Настройки DNS

# ControlPanel_DnsItem.Text
source: DNS Settings
ru_ru: Настройки DNS

# Dns_ResetDefaults
source: Reset to defaults
ru_ru: Восстановить значения по умолчанию

# Dns_ServerPlaceholder
source: Enter IP or DoH address (empty = auto)
ru_ru: IP-адрес или адрес DoH (пусто — автоматически)

# Dns_QueryStrategyLabel
source: Query strategy
ru_ru: Стратегия запросов

# Dns_EnableCacheLabel
source: Enable DNS cache
ru_ru: Кэшировать DNS-запросы

# Dns_DirectTitle
source: Direct DNS
ru_ru: Прямой DNS

# Dns_DirectDesc
source: For domestic domains (geosite:cn), resolved directly without proxy
ru_ru: Для доменов региона прямой маршрутизации; запросы выполняются без прокси

# Dns_ProxyTitle
source: Proxy DNS
ru_ru: DNS через прокси

# Dns_ProxyDesc
source: For foreign domains, resolved via proxy outbound to prevent DNS hijacking
ru_ru: Для остальных доменов; запросы идут через прокси для защиты от подмены DNS

# Dns_TunOnlyHint
source: TUN mode only
ru_ru: Только в режиме TUN

# Dns_Experimental
source: Experimental
ru_ru: Экспериментально

# Dns_Strategy_V4Only
source: IPv4 only
ru_ru: Только IPv4

# Dns_Strategy_V6Only
source: IPv6 only
ru_ru: Только IPv6

# Dns_Strategy_Auto
source: Auto
ru_ru: Автоматически

# Error_NoServer
source: No Server Selected
ru_ru: Сервер не выбран

# Error_NoServerMsg
source: Please select a server from the list first
ru_ru: Сначала выберите сервер в списке

# Error_StartFailed
source: Start Failed
ru_ru: Не удалось запустить

# Error_XrayStartFailed
source: xray failed to start. Please check server configuration.
ru_ru: Не удалось запустить Xray. Проверьте настройки сервера.

# Error_ReapplyFailed
source: Apply Configuration Failed
ru_ru: Не удалось применить настройки

# Error_XrayReapplyFailed
source: xray failed to apply new configuration and has stopped.
ru_ru: Xray не смог применить новую конфигурацию и был остановлен.

# Error_UpdateFailed
source: Update Failed
ru_ru: Не удалось обновить

# Error_UpdaterLaunchFailed
source: Could not launch updater: {0}
ru_ru: Не удалось запустить программу обновления: {0}

# Update_Updating
source: Updating XrayUI
ru_ru: Обновление XrayUI

# Tun_EnableTitle
source: Enable TUN Mode
ru_ru: Включить режим TUN

# Tun_EnableMsg.Text
source: Enabling TUN mode requires administrator privileges. The app will restart. Continue?
ru_ru: Для режима TUN нужны права администратора. Приложение будет перезапущено. Продолжить?

# Main_NoSelection
source: Not selected
ru_ru: Не выбран

# Main_NotConnected
source: Not connected
ru_ru: Нет подключения

# Update_FetchingChecksum
source: Fetching checksum file…
ru_ru: Загрузка файла контрольных сумм…

# Update_ChecksumFormatError
source: Update checksum file format error
ru_ru: Неверный формат файла контрольных сумм обновления

# Update_ChecksumDownloadFailed
source: Could not download update checksum file:
ru_ru: Не удалось загрузить файл контрольных сумм обновления:

# Update_ChecksumMismatch
source: Update verification failed: SHA256 does not match the server checksum.
ru_ru: Проверка обновления не пройдена: SHA-256 не совпадает с контрольной суммой сервера.

# Update_Extracting
source: Extracting update…
ru_ru: Распаковка обновления…

# Update_ExtractFailed
source: Update extraction failed:
ru_ru: Не удалось распаковать обновление:

# Update_Verifying
source: Verifying update…
ru_ru: Проверка обновления…

# Update_MissingFiles
source: Update package is invalid: required files are missing.
ru_ru: Пакет обновления повреждён: отсутствуют необходимые файлы.

# Update_VersionMismatch
source: Update version mismatch: expected {0}, got {1}.
ru_ru: Версия обновления не совпадает: ожидалась {0}, получена {1}.

# Update_MissingUpdater
source: Updater component missing. Please re-download the full installer.
ru_ru: Компонент обновления отсутствует. Загрузите полный пакет приложения заново.

# Update_PrepRestart
source: Preparing to restart…
ru_ru: Подготовка к перезапуску…

# Update_Downloading
source: Downloading {0} … {1:0.0} / {2:0.0} MB
ru_ru: Загрузка {0}… {1:0.0} / {2:0.0} МБ

# Update_DownloadingNoTotal
source: Downloading {0} … {1:0.0} MB
ru_ru: Загрузка {0}… {1:0.0} МБ

# AddRule_EditTitle
source: Edit Rule
ru_ru: Изменить правило

# Error_ExportFailed
source: Export Failed
ru_ru: Не удалось экспортировать

# Subscription_NeverUpdated
source: Last updated: never
ru_ru: Ещё не обновлялась

# Subscription_JustNow
source: just now
ru_ru: только что

# Subscription_MinutesAgo
source: {0} min ago
ru_ru: {0} мин. назад

# Subscription_HoursAgo
source: {0} hr ago
ru_ru: {0} ч. назад

# Subscription_DaysAgo
source: {0} days ago
ru_ru: {0} дн. назад

# Subscription_LastUpdated
source: Last updated: {0}
ru_ru: Последнее обновление: {0}

# ControlPanel_EditPortItem.Text
source: Edit Port
ru_ru: Изменить порт

# ControlPanel_ViewLogItem.Text
source: Logs
ru_ru: Журнал

# ControlPanel_ProxySettingsItem.Text
source: Proxy Setting
ru_ru: Настройки прокси

# ControlPanel_GlobalProxyItem.Text
source: System Proxy
ru_ru: Системный прокси

# ControlPanel_NoProxyItem.Text
source: Bypass System Proxy
ru_ru: Не менять системный прокси

# ControlPanel_StartupItem.Text
source: Startup
ru_ru: Автозапуск

# ControlPanel_RoutingSettingsItem.Text
source: Routing
ru_ru: Маршрутизация

# ControlPanel_RoutingGlobalItem.Text
source: Global
ru_ru: Глобальная

# ControlPanel_RoutingSmartItem.Text
source: Smart
ru_ru: По правилам

# ControlPanel_CustomRulesItem.Text
source: Custom Rules...
ru_ru: Свои правила…

# ControlPanel_TunModeLabel.Text
source: TUN Mode
ru_ru: Режим TUN

# ControlPanel_RoutingLbl.Text
source: Routing:
ru_ru: Маршрут:

# Personalize_LanguageLbl.Text
source: Language & Region
ru_ru: Язык и регион

# ServerList_HeaderText.Text
source: Server List
ru_ru: Список серверов

# ServerList_AddBtnText.Text
source: Add
ru_ru: Добавить

# ServerList_ImportNodeItem.Text
source: Import Nodes
ru_ru: Импорт серверов

# ServerList_AddSubscriptionItem.Text
source: Add Subscription
ru_ru: Добавить подписку

# ServerList_AddManualItem.Text
source: Add Manually
ru_ru: Добавить вручную

# ServerList_AddChainProxyItem.Text
source: Chain Proxy
ru_ru: Цепочка прокси

# ServerList_EditText.Text
source: Edit
ru_ru: Изменить

# ServerList_DeleteText.Text
source: Delete
ru_ru: Удалить

# ServerList_SearchBox.PlaceholderText
source: Search servers
ru_ru: Поиск серверов

# ServerList_FilterLabelText.Text
source: Filter:
ru_ru: Фильтр:

# ServerList_SortDefaultItem.Text
source: Default
ru_ru: По умолчанию

# ServerList_SortActiveItem.Text
source: Active
ru_ru: По активности

# ServerList_SortProtocolItem.Text
source: Protocol
ru_ru: По протоколу

# ServerList_SortLatencyItem.Text
source: Latency
ru_ru: По задержке

# ServerList_ActivatedBadge.Text
source: ● Activated
ru_ru: ● Активен

# ServerList_ChainBadgeText.Text
source: Chain Proxy
ru_ru: Цепочка прокси

# ServerList_Favorites
source: Favorites
ru_ru: Избранное

# ServerList_AddFavorite
source: Add to Favorites
ru_ru: В избранное

# ServerList_RemoveFavorite
source: Remove from Favorites
ru_ru: Убрать из избранного

# ServerList_FilterTooltip
source: Filter
ru_ru: Группы и сортировка

# ServerList_SortTooltip
source: Sort
ru_ru: Сортировка

# ServerList_TestLatencyTooltip
source: Test latency
ru_ru: Измерить задержку

# Confirm_DeleteBatchMsg
source: Are you sure you want to delete the selected {0} items?
ru_ru: Удалить выбранные элементы ({0})?

# Subscription_UnknownError
source: Unknown error
ru_ru: Неизвестная ошибка

# ServerDetail_HeaderText.Text
source: Server Details
ru_ru: Сведения о сервере

# ServerDetail_ProtocolLabel.Text
source: Protocol
ru_ru: Протокол

# ServerDetail_TransportLabel.Text
source: Transport
ru_ru: Транспорт

# ServerDetail_AiUnlockLabel.Text
source: AI Unlock Status
ru_ru: Доступ к ИИ-сервисам

# ServerDetail_LatencyLabel.Text
source: Latency
ru_ru: Задержка

# ServerDetail_Entry
source: Entry
ru_ru: Вход

# ServerDetail_Exit
source: Exit
ru_ru: Выход

# ServerDetail_EntryMissing
source: (entry node missing)
ru_ru: (входной сервер отсутствует)

# ServerDetail_ExitMissing
source: (exit node missing)
ru_ru: (выходной сервер отсутствует)

# ServerDetail_AuthLabel
source: Auth
ru_ru: Авторизация

# ServerDetail_ChainLabel
source: Chain
ru_ru: Цепочка

# ServerDetail_NoAuth
source: No auth
ru_ru: Без авторизации

# ServerDetail_UserPass
source: Username/Password
ru_ru: Имя пользователя / пароль

# ServerDetail_LatencyMs
source: {0} ms
ru_ru: {0} мс

# MainWindow_TitleText.Text
source: Proxy Panel
ru_ru: Панель прокси

# CustomRules_RuleListText.Text
source: Rules
ru_ru: Правила

# CustomRules_AddBtnText.Text
source: Add
ru_ru: Добавить

# CustomRules_NotEffectiveText.Text
source: Global routing is active. Custom rules apply only in Smart Routing.
ru_ru: Включена глобальная маршрутизация. Свои правила действуют только в режиме «По правилам».

# CustomRules_SaveBtn.Content
source: Save
ru_ru: Сохранить

# CustomRules_CancelBtn.Content
source: Cancel
ru_ru: Отмена

# CustomRules_AdvancedEditorTooltip
source: Advanced edit (open settings.json externally)
ru_ru: Расширенное редактирование (открыть settings.json во внешнем редакторе)

# CustomRules_EditRowTooltip
source: Edit
ru_ru: Изменить

# CustomRules_DeleteRowTooltip
source: Delete
ru_ru: Удалить

# CustomRules_PrepFailedTitle
source: Could not prepare settings.json
ru_ru: Не удалось подготовить settings.json

# CustomRules_OpenEditorFailedTitle
source: Could not open editor
ru_ru: Не удалось открыть редактор

# CustomRules_OpenEditorFailedMsg
source: No .json file association or launch failed: {0}
ru_ru: Для .json не назначено приложение или запуск не удался: {0}

# AddRule_TypeLabelText.Text
source: Type
ru_ru: Тип

# AddRule_TypeDomainItem.Content
source: Domain
ru_ru: Домен

# AddRule_TypeProcessItem.Content
source: Process
ru_ru: Процесс

# AddRule_MatchLabelText.Text
source: Match Content
ru_ru: Условие совпадения

# AddRule_BrowseNameItem.Content
source: Match by name
ru_ru: По имени

# AddRule_BrowsePathItem.Content
source: Match by full path
ru_ru: По полному пути

# AddRule_BrowseFolderItem.Content
source: Match entire folder
ru_ru: По всей папке

# AddRule_OutboundLabelText.Text
source: Outbound
ru_ru: Направление

# AddRule_OutboundProxyItem.Content
source: proxy
ru_ru: Через прокси

# AddRule_OutboundDirectItem.Content
source: direct
ru_ru: Напрямую

# AddRule_OutboundBlockItem.Content
source: block
ru_ru: Блокировать

# AddRule_ErrorTextElem.Text
source: Please enter match content
ru_ru: Укажите условие совпадения

# AddRule_BrowseExe
source: Browse exe files...
ru_ru: Выбрать exe-файлы…

# AddRule_BrowseFolder
source: Browse folder...
ru_ru: Выбрать папку…

# AddRule_PlaceholderDomain
source: One domain or rule per line (e.g. youtube.com or geosite:cn)
ru_ru: Домен или правило на каждой строке (например, youtube.com или geosite:cn)

# AddRule_PlaceholderIp
source: One IP rule per line (e.g. 192.168.0.0/16 or geoip:cn)
ru_ru: IP-правило на каждой строке (например, 192.168.0.0/16 или geoip:cn)

# AddRule_PlaceholderProcess
source: One process name, full path, or folder per line
ru_ru: Имя процесса, полный путь или папка на каждой строке

# AddRule_HintDomain
source: Supports exact match and regexp:/geosite: prefixes. Add one value per line.
ru_ru: Точное совпадение или префиксы regexp:/geosite:. Каждое значение — на отдельной строке.

# AddRule_HintIp
source: Supports CIDR and geoip: prefixes. Add one value per line.
ru_ru: Поддерживаются CIDR и префикс geoip:. Каждое значение — на отдельной строке.

# AddRule_HintProcess
source: One value per line; Browse supports multi-select and removes duplicates.
ru_ru: Каждое значение — на отдельной строке. При выборе файлов можно выделить несколько; дубликаты удаляются.

# Personalize_AppLanguageTitle.Text
source: Application language
ru_ru: Язык приложения

# Personalize_AppLanguageDesc.Text
source: Choose interface language
ru_ru: Выберите язык интерфейса

# Personalize_LangRestartBar.Title
source: Restart XrayUI to apply changes
ru_ru: Перезапустите XrayUI для применения региона маршрутизации

# Personalize_LangRestartBtn.Content
source: Restart
ru_ru: Перезапустить

# Personalize_ProtocolColorsDesc.Text
source: Customize the color indicator for each protocol
ru_ru: Настройте цвет индикатора для каждого протокола

# Personalize_DetailsHeader.Text
source: Server info display
ru_ru: Сведения о сервере

# Personalize_DetailsDesc.Text
source: Choose what to show on the detail card
ru_ru: Выберите данные для карточки сервера

# Personalize_DetailLatency.Text
source: Latency
ru_ru: Задержка

# Personalize_DetailLatencyDesc.Text
source: Show latency on the node card
ru_ru: Показывать задержку в карточке сервера

# Personalize_DetailAiUnlock.Text
source: AI Unlock
ru_ru: Доступ к ИИ

# Personalize_DetailAiUnlockDesc.Text
source: Show AI unlock status on the node card
ru_ru: Показывать доступность ИИ-сервисов в карточке

# Personalize_ImportExportTitle.Text
source: Import and Export your data
ru_ru: Импорт и экспорт данных

# Personalize_ImportExportDesc.Text
source: Back up the current nodes and routing rules, or restore from a file
ru_ru: Сохраните серверы и правила маршрутизации или восстановите их из файла

# Personalize_ExportBtn.Content
source: Export
ru_ru: Экспорт

# Personalize_ImportBtn.Content
source: Import
ru_ru: Импорт

# Personalize_ImportMenuRestore.Text
source: Restore from Backup
ru_ru: Восстановить из копии

# Personalize_ImportMenuClash.Text
source: Import Clash Config
ru_ru: Импорт конфигурации Clash

# Personalize_ClashImportSuccess
source: Clash config imported
ru_ru: Конфигурация Clash импортирована

# Personalize_ClashImportSuccessMsg
source: Imported {0} node(s), skipped {1} unsupported.
ru_ru: Импортировано серверов: {0}; пропущено неподдерживаемых: {1}.

# Personalize_ClashImportNoNodesTitle
source: No nodes imported
ru_ru: Серверы не импортированы

# Personalize_ClashImportNoNodesMsg
source: No importable nodes found in this file (all unsupported protocols, or not a valid Clash config).
ru_ru: В файле нет подходящих серверов: протоколы не поддерживаются или это не конфигурация Clash.

# Personalize_ClashImportFailed
source: Clash import failed
ru_ru: Не удалось импортировать Clash

# Personalize_ExportTooltip
source: Export preset configuration
ru_ru: Экспорт конфигурации
